Dr-RegEx/contest2026_497_nitelabu/workspace/openvela-untracked/nuttx/arch/risc-v/src/esp32s31/esp32s31_i2s_duplex.c
/****************************************************************************
 * arch/risc-v/src/esp32s31/esp32s31_i2s_duplex.c
 * SPDX-License-Identifier: Apache-2.0
 ****************************************************************************/

#include <nuttx/config.h>
#include <nuttx/arch.h>
#include <nuttx/atomic.h>
#include <nuttx/audio/audio.h>
#include <nuttx/clock.h>
#include <nuttx/irq.h>
#include <nuttx/kmalloc.h>
#include <nuttx/kthread.h>
#include <nuttx/mutex.h>
#ifdef CONFIG_ARCH_ADDRENV
#  include <nuttx/addrenv.h>
#  include <nuttx/sched.h>
#endif
#include <nuttx/semaphore.h>
#include <nuttx/spinlock.h>
#include <errno.h>
#include <debug.h>
#include <stdint.h>
#include <string.h>
#ifdef CONFIG_ESP32S31_FLASH_AUDIO_TRACE
#  include <stdio.h>
#  include <nuttx/sched.h>
#  include <nuttx/signal.h>
#  include "riscv_internal.h"
#endif
#include "esp32s31_i2s.h"
#include "esp_irq.h"
#include "espressif/esp_gpio.h"
#include "esp_attr.h"
#include "esp_cache.h"
#include "esp_memory_utils.h"
#include "esp_private/esp_clk.h"
#include "hal/ahb_dma_ll.h"
#include "hal/dma_types.h"
#include "hal/gdma_ll.h"
#include "hal/i2s_hal.h"
#include "hal/gdma_channel.h"
#include "soc/gpio_sig_map.h"
#include "soc/interrupts.h"

/* Deliberately isolated from the half-duplex driver. RX owns the continuous
 * 48 kHz clock, including while no capture buffer is queued. TX is a slave.
 * All DMA memory is internal SRAM. Each descriptor occupies its own cache
 * line; this implementation additionally requires non-cacheable SRAM.
 */

#define DUP_DMA AHB_DMA_LL_GET_HW(0)
#define DUP_BLOCK 512
#define DUP_SLOTS 4
#define DUP_LIMIT 8
#define DUP_RX_SOURCE ETS_AHB_PDMA_IN_CH0_INTR_SOURCE
#define DUP_TX_SOURCE ETS_AHB_PDMA_OUT_CH0_INTR_SOURCE
#define DUP_RX_ERRORS (GDMA_LL_EVENT_RX_DESC_ERROR | \
                       GDMA_LL_EVENT_RX_ERR_EOF | \
                       GDMA_LL_EVENT_RX_DESC_EMPTY | GDMA_LL_EVENT_RX_FIFO_OVF)
#define DUP_TX_ERRORS (GDMA_LL_EVENT_TX_DESC_ERROR | GDMA_LL_EVENT_TX_FIFO_UDF)

#ifdef CONFIG_ESP32S31_I2S_CAPTURE_16K_MONO
#  define DUP_RATE 16000u
#elif defined(CONFIG_ESP32S31_I2S_DUPLEX_44K)
#  define DUP_RATE 44100u
#else
#  define DUP_RATE 48000u
#endif
#define DUP_MCLK (DUP_RATE * 256u)
#define DUP_BYTES_PER_SECOND (DUP_RATE * 4u)

struct dup_request_s
{
  struct dup_request_s *next;
  struct ap_buffer_s *apb;
  i2s_callback_t callback;
  void *arg;
  size_t bytes;
  size_t scheduled;
  size_t completed;
  clock_t queued;
  clock_t queue_timeout;
  clock_t started;
  clock_t timeout;
  bool started_valid;
  int result;
#ifdef CONFIG_ARCH_ADDRENV
  struct addrenv_s *addrenv;
#endif
};

struct dup_endpoint_s
{
  struct i2s_dev_s dev;
  struct dup_request_s *head;
  struct dup_request_s *tail;
  struct dup_request_s *slotreq[DUP_SLOTS];
  size_t slotbytes[DUP_SLOTS];
  unsigned int pending;
  unsigned int index;
  bool rx;
  bool active;
  bool dma_running;
  atomic_t errors;
};

struct dup_desc_s
{
  dma_descriptor_t desc;
  uint8_t padding[64 - sizeof(dma_descriptor_t)];
} __attribute__((aligned(64)));

static struct dup_endpoint_s g_ep[2]; /* 0: playback, 1: capture */
static i2s_hal_context_t g_hal;
static mutex_t g_lock = NXMUTEX_INITIALIZER;
static sem_t g_wake;
static bool g_ready;
#ifdef CONFIG_ESP32S31_FLASH_AUDIO_TRACE
volatile bool g_esp32s31_audio_trace_active;

/* One-shot diagnostic: copy task state under scheduler protection and print
 * only after traversal. This observer sleeps while playback starts.
 */

static struct
{
  pid_t pid;
  int priority;
  int state;
  int locks;
  uintptr_t pc;
  char name[32];
} g_trace_tasks[32];
static unsigned int g_trace_ntasks;

static void dup_trace_task(struct tcb_s *tcb, void *arg)
{
  unsigned int n = g_trace_ntasks;

  if (n < 32)
    {
      g_trace_tasks[n].pid = tcb->pid;
      g_trace_tasks[n].priority = tcb->sched_priority;
      g_trace_tasks[n].state = tcb->task_state;
      g_trace_tasks[n].locks = tcb->lockcount;
      g_trace_tasks[n].pc = tcb->xcp.regs ? tcb->xcp.regs[REG_EPC] : 0;
      strlcpy(g_trace_tasks[n].name, tcb->name,
              sizeof(g_trace_tasks[n].name));
      g_trace_ntasks++;
    }
}

static int dup_trace_observer(int argc, char *argv[])
{
  while (!g_esp32s31_audio_trace_active)
    {
      nxsig_usleep(100000);
    }

  nxsig_usleep(10000000);
  nxsched_foreach(dup_trace_task, NULL);
  for (unsigned int n = 0; n < g_trace_ntasks; n++)
    {
      printf("\nTASKTRACE pid=%d prio=%d state=%d locks=%d pc=%08lx %s\n",
             g_trace_tasks[n].pid, g_trace_tasks[n].priority,
             g_trace_tasks[n].state, g_trace_tasks[n].locks,
             (unsigned long)g_trace_tasks[n].pc, g_trace_tasks[n].name);
    }

  return 0;
}
#endif
static DRAM_ATTR struct dup_desc_s g_desc[2][DUP_SLOTS];
static DRAM_ATTR uint8_t g_data[2][DUP_SLOTS][DUP_BLOCK]
  __attribute__((aligned(64)));

static void dup_stop_dma(struct dup_endpoint_s *ep)
{
  if (ep->rx)
    {
      ahb_dma_ll_rx_enable_interrupt(DUP_DMA, 0, UINT32_MAX, false);
      i2s_ll_rx_stop(g_hal.dev);
      ahb_dma_ll_rx_stop(DUP_DMA, 0);
      ahb_dma_ll_rx_reset_channel(DUP_DMA, 0);
    }
  else
    {
      esp32s31_audio_pa(false);
      ahb_dma_ll_tx_enable_interrupt(DUP_DMA, 0, UINT32_MAX, false);
      i2s_ll_tx_stop(g_hal.dev);
      ahb_dma_ll_tx_stop(DUP_DMA, 0);
      ahb_dma_ll_tx_reset_channel(DUP_DMA, 0);
    }

  ep->dma_running = false;
#ifdef CONFIG_ESP32S31_FLASH_AUDIO_TRACE
  if (!g_ep[0].dma_running && !g_ep[1].dma_running)
    {
      g_esp32s31_audio_trace_active = false;
    }
#endif
}

static void dup_cancel(struct dup_endpoint_s *ep, int result)
{
  struct dup_request_s *req;
  unsigned int i;

  ep->active = false;
  if (!ep->rx || !g_ep[0].active)
    {
      dup_stop_dma(ep);
    }

  for (i = 0; i < DUP_SLOTS; i++)
    {
      ep->slotreq[i] = NULL;
      ep->slotbytes[i] = 0;
    }

  for (req = ep->head; req != NULL; req = req->next)
    {
      req->result = result;
      req->completed = req->bytes;
    }

  if (!g_ep[0].active && !g_ep[1].active)
    {
      dup_stop_dma(&g_ep[1]);
    }
}

static int dup_irq(int irq, void *context, void *arg)
{
  struct dup_endpoint_s *ep = arg;
  uint32_t status;

  if (ep->rx)
    {
      status = ahb_dma_ll_rx_get_interrupt_status(DUP_DMA, 0, false);
      ahb_dma_ll_rx_clear_interrupt_status(DUP_DMA, 0, status);
      atomic_or(&ep->errors, status & DUP_RX_ERRORS);
    }
  else
    {
      status = ahb_dma_ll_tx_get_interrupt_status(DUP_DMA, 0, false);
      ahb_dma_ll_tx_clear_interrupt_status(DUP_DMA, 0, status);
      atomic_or(&ep->errors, status & DUP_TX_ERRORS);
    }

  nxsem_post(&g_wake);
  return OK;
}

static void dup_configure(void)
{
  i2s_hal_slot_config_t slot =
  {
    .data_bit_width = I2S_DATA_BIT_WIDTH_16BIT,
    .slot_bit_width = I2S_SLOT_BIT_WIDTH_16BIT,
    .slot_mode = I2S_SLOT_MODE_STEREO,
    .std =
    {
      .slot_mask = I2S_STD_SLOT_BOTH,
      .ws_width = 16,
      .bit_shift = true,
#if defined(CONFIG_ESP32S31_I2S_DUPLEX_44K) || \
    defined(CONFIG_ESP32S31_I2S_CAPTURE_16K_MONO)
      .left_align = true,
#endif
    },
  };
  i2s_hal_clock_info_t clk =
  {
    .sclk = esp_clk_xtal_freq(),
    .mclk = DUP_MCLK,
    .bclk = DUP_RATE * 32,
    .bclk_div = 8,
  };
  int __DECLARE_RCC_ATOMIC_ENV = 0;
  irqstate_t flags = enter_critical_section();

#ifdef CONFIG_ESP32S31_I2S_CAPTURE_16K_MONO
  slot.slot_mode = I2S_SLOT_MODE_MONO;
  slot.std.slot_mask = I2S_STD_SLOT_LEFT;
#endif
  i2s_hal_std_set_rx_slot(&g_hal, false, &slot);
  i2s_hal_std_enable_rx_channel(&g_hal);
#ifdef CONFIG_ESP32S31_I2S_CAPTURE_16K_MONO
  slot.slot_mode = I2S_SLOT_MODE_STEREO;
  slot.std.slot_mask = I2S_STD_SLOT_BOTH;
#endif
  i2s_hal_std_set_tx_slot(&g_hal, true, &slot);
  i2s_hal_std_enable_tx_channel(&g_hal);
  i2s_ll_share_bck_ws(g_hal.dev, true);
  /* Program the slave clock gate/divider too; RX is programmed last so
   * MCLK remains bound to the master, as in the pinned IDF duplex setup.
   */

