Dr-RegEx/contest2026_497_nitelabu/workspace/openvela-untracked/nuttx/arch/risc-v/src/esp32s31/esp32s31_i2s_duplex.c
  i2s_hal_set_tx_clock(&g_hal, &clk, I2S_CLK_SRC_XTAL, NULL);
  i2s_hal_set_rx_clock(&g_hal, &clk, I2S_CLK_SRC_XTAL, NULL);
  i2s_ll_rx_enable_recomb(g_hal.dev, false);
  leave_critical_section(flags);
  esp_gpio_matrix_out(52, I2S0_MCLK_PAD_OUT_IDX, false, false);
  esp_gpio_matrix_out(53, I2S0_I_BCK_PAD_OUT_IDX, false, false);
  esp_gpio_matrix_out(55, I2S0_I_WS_PAD_OUT_IDX, false, false);
}

static int dup_start_dma(struct dup_endpoint_s *ep)
{
  dma_descriptor_t *desc;
  unsigned int i;
  unsigned int retry;

  ep->index = 0;
  atomic_xchg(&ep->errors, 0);
  memset(g_data[ep->rx], 0, sizeof(g_data[ep->rx]));
  for (i = 0; i < DUP_SLOTS; i++)
    {
      desc = &g_desc[ep->rx][i].desc;
      memset(desc, 0, sizeof(*desc));
      desc->dw0.size = DUP_BLOCK;
      desc->dw0.length = ep->rx ? 0 : DUP_BLOCK;
      desc->dw0.suc_eof = !ep->rx;
      desc->buffer = g_data[ep->rx][i];
      desc->next = &g_desc[ep->rx][(i + 1) % DUP_SLOTS].desc;
      ep->slotreq[i] = NULL;
      ep->slotbytes[i] = 0;
      desc->dw0.owner = DMA_DESCRIPTOR_BUFFER_OWNER_DMA;
    }

  __sync_synchronize();
  desc = &g_desc[ep->rx][0].desc;
  if (ep->rx)
    {
      i2s_ll_rx_reset_fifo(g_hal.dev);
      ahb_dma_ll_rx_reset_channel(DUP_DMA, 0);
      ahb_dma_ll_rx_clear_interrupt_status(DUP_DMA, 0, UINT32_MAX);
      ahb_dma_ll_rx_set_desc_addr(DUP_DMA, 0, (uintptr_t)desc);
      i2s_ll_rx_set_eof_num(g_hal.dev, DUP_BLOCK);
      ahb_dma_ll_rx_enable_interrupt(DUP_DMA, 0,
        DUP_RX_ERRORS | GDMA_LL_EVENT_RX_SUC_EOF, true);
      ahb_dma_ll_rx_start(DUP_DMA, 0);
      g_hal.dev->rx_conf.rx_update = 1;
    }
  else
    {
      i2s_ll_tx_reset_fifo(g_hal.dev);
      ahb_dma_ll_tx_reset_channel(DUP_DMA, 0);
      ahb_dma_ll_tx_clear_interrupt_status(DUP_DMA, 0, UINT32_MAX);
      ahb_dma_ll_tx_set_desc_addr(DUP_DMA, 0, (uintptr_t)desc);
      ahb_dma_ll_tx_enable_interrupt(DUP_DMA, 0,
        DUP_TX_ERRORS | GDMA_LL_EVENT_TX_EOF, true);
      ahb_dma_ll_tx_start(DUP_DMA, 0);
      g_hal.dev->tx_conf.tx_update = 1;
    }

  for (retry = 0; retry < 10000; retry++)
    {
      if (!(ep->rx ? g_hal.dev->rx_conf.rx_update :
                    g_hal.dev->tx_conf.tx_update))
        {
          if (ep->rx)
            {
              g_hal.dev->rx_conf.rx_start = 1;
            }
          else
            {
              esp32s31_audio_pa(true);
              g_hal.dev->tx_conf.tx_start = 1;
            }

          ep->dma_running = true;
#ifdef CONFIG_ESP32S31_FLASH_AUDIO_TRACE
          g_esp32s31_audio_trace_active = true;
#endif
          return OK;
        }

      up_udelay(1);
    }

  dup_stop_dma(ep);
  return -ETIMEDOUT;
}

/* Only the worker touches request offsets and ring payloads, under g_lock.
 * A descriptor is returned to DMA only after its CPU payload work is done.
 */

static void dup_service(struct dup_endpoint_s *ep)
{
  struct dup_request_s *req;
  volatile dma_descriptor_t *desc;
  uint8_t *buffer;
  size_t amount;
  size_t offset;
  unsigned int count;
  unsigned int index;
#ifdef CONFIG_ARCH_ADDRENV
  struct addrenv_s *oldenv;
#endif

  if (!ep->dma_running)
    {
      return;
    }

  for (count = 0; count < DUP_SLOTS; count++)
    {
      index = ep->index;
      desc = &g_desc[ep->rx][index].desc;
      if (desc->dw0.owner != DMA_DESCRIPTOR_BUFFER_OWNER_CPU)
        {
          break;
        }

      __sync_synchronize();
      buffer = g_data[ep->rx][index];
      if (ep->rx)
        {
          if (desc->dw0.err_eof || desc->dw0.length != DUP_BLOCK)
            {
              auderr("RX descriptor: err_eof=%u length=%u\n",
                     desc->dw0.err_eof, desc->dw0.length);
              atomic_or(&ep->errors, DUP_RX_ERRORS);
              return;
            }

          offset = 0;
          for (req = ep->head; req != NULL && offset < DUP_BLOCK;
               req = req->next)
            {
              if (!ep->active || req->result != OK ||
                  req->completed == req->bytes)
                {
                  continue;
                }

              if (!req->started_valid)
                {
                  req->started = clock_systime_ticks();
                  req->started_valid = true;
                }

              amount = req->bytes - req->completed;
              if (amount > DUP_BLOCK - offset)
                {
                  amount = DUP_BLOCK - offset;
                }

#ifdef CONFIG_ARCH_ADDRENV
              DEBUGVERIFY(addrenv_select(req->addrenv, &oldenv));
#endif
              memcpy(req->apb->samp + req->completed, buffer + offset,
                     amount);
#ifdef CONFIG_ARCH_ADDRENV
              DEBUGVERIFY(addrenv_restore(oldenv));
#endif
              req->completed += amount;
              offset += amount;
            }
        }
      else
        {
          req = ep->slotreq[index];
          if (req != NULL)
            {
              req->completed += ep->slotbytes[index];
            }

          ep->slotreq[index] = NULL;
          ep->slotbytes[index] = 0;
          memset(buffer, 0, DUP_BLOCK);
          for (req = ep->head; req != NULL; req = req->next)
            {
              if (req->result == OK && req->scheduled < req->bytes)
                {
                  break;
                }
            }

          if (req != NULL)
            {
              if (!req->started_valid)
                {
                  req->started = clock_systime_ticks();
                  req->started_valid = true;
                }

              amount = req->bytes - req->scheduled;
              if (amount > DUP_BLOCK)
                {
                  amount = DUP_BLOCK;
                }

#ifdef CONFIG_ARCH_ADDRENV
              DEBUGVERIFY(addrenv_select(req->addrenv, &oldenv));
#endif
              memcpy(buffer, req->apb->samp + req->apb->curbyte +
                     req->scheduled, amount);
#ifdef CONFIG_ARCH_ADDRENV
              DEBUGVERIFY(addrenv_restore(oldenv));
#endif
              req->scheduled += amount;
              ep->slotreq[index] = req;
              ep->slotbytes[index] = amount;
            }
        }

      desc->dw0.length = ep->rx ? 0 : DUP_BLOCK;
      desc->dw0.err_eof = 0;
      __sync_synchronize();
      desc->dw0.owner = DMA_DESCRIPTOR_BUFFER_OWNER_DMA;
      __sync_synchronize();
      ep->index = (index + 1) % DUP_SLOTS;
    }
}

