Dr-RegEx/contest2026_497_nitelabu/workspace/openvela-untracked/nuttx/arch/risc-v/src/esp32s31/esp32s31_i2s_duplex.c
static int dup_worker(int argc, char *argv[])
{
  struct dup_endpoint_s *ep;
  struct dup_request_s *req;
  struct dup_request_s *done;
  struct dup_request_s *last;
  unsigned int direction;
  uint32_t errors[2];

  for (;;)
    {
      nxsem_tickwait_uninterruptible(&g_wake, MSEC2TICK(5) + 1);
      nxmutex_lock(&g_lock);
      /* ISR publication and worker read/clear must use the same atomic
       * protocol.  A mutex cannot protect against an interrupt, including
       * one delivered on the other CPU.
       */

      errors[0] = atomic_xchg(&g_ep[0].errors, 0);
      errors[1] = atomic_xchg(&g_ep[1].errors, 0);
      if (errors[0] != 0 || errors[1] != 0)
        {
          auderr("DMA errors TX=%08lx RX=%08lx\n",
                 (unsigned long)errors[0], (unsigned long)errors[1]);
        }

      if (errors[1] != 0)
        {
          /* A failed clock master also invalidates its slave. */

          dup_cancel(&g_ep[0], -EIO);
          dup_cancel(&g_ep[1], -EIO);
        }
      else if (errors[0] != 0)
        {
          dup_cancel(&g_ep[0], -EIO);
        }

      dup_service(&g_ep[1]);
      dup_service(&g_ep[0]);
      for (direction = 0; direction < 2; direction++)
        {
          ep = &g_ep[direction];
          for (req = ep->head; req != NULL; req = req->next)
            {
              if (req->completed < req->bytes &&
                  ((req->started_valid &&
                    clock_systime_ticks() - req->started >= req->timeout) ||
                   (!req->started_valid &&
                    clock_systime_ticks() - req->queued >=
                    req->queue_timeout)))
                {
                  dup_cancel(ep, -ETIMEDOUT);
                  break;
                }
            }

          done = NULL;
          last = NULL;
          while (ep->head != NULL &&
                 ep->head->completed == ep->head->bytes)
            {
              req = ep->head;
              ep->head = req->next;
              ep->pending--;
              if (ep->head == NULL)
                {
                  ep->tail = NULL;
                }

              req->next = NULL;
              if (last == NULL)
                {
                  done = req;
                }
              else
                {
                  last->next = req;
                }

              last = req;
            }

          nxmutex_unlock(&g_lock);
          while (done != NULL)
            {
              req = done;
              done = req->next;
#ifdef CONFIG_ARCH_ADDRENV
              struct addrenv_s *oldenv;

              DEBUGVERIFY(addrenv_select(req->addrenv, &oldenv));
#endif
              if (req->result == OK)
                {
                  if (ep->rx)
                    {
                      req->apb->nbytes = req->bytes;
                      req->apb->curbyte = 0;
                    }
                  /* TX offsets are tracked in req. Leave the caller's
                   * cursor unchanged: the audio upper half recycles mmap
                   * periods by resetting nbytes, without resetting curbyte.
                   */
                }

              req->callback(&ep->dev, req->apb, req->arg, req->result);
              apb_free(req->apb);
#ifdef CONFIG_ARCH_ADDRENV
              DEBUGVERIFY(addrenv_restore(oldenv));
              addrenv_drop(req->addrenv, false);
#endif
              kmm_free(req);
            }

          nxmutex_lock(&g_lock);
        }

      nxmutex_unlock(&g_lock);
    }

  return OK;
}

static int dup_enqueue(struct i2s_dev_s *dev, struct ap_buffer_s *apb,
                       i2s_callback_t callback, void *arg, uint32_t timeout,
                       bool rx)
{
  struct dup_endpoint_s *ep = (struct dup_endpoint_s *)dev;
  struct dup_request_s *req;
  struct dup_request_s *prior;
  size_t ahead = 0;
  uint32_t byte_rate = DUP_BYTES_PER_SECOND;
#ifdef CONFIG_ESP32S31_I2S_CAPTURE_16K_MONO
  if (rx)
    {
      byte_rate = DUP_RATE * 2u;
    }
#endif
  size_t bytes;
  int ret = OK;

  if (ep->rx != rx || apb == NULL || apb->samp == NULL ||
      callback == NULL || apb->curbyte > apb->nbytes ||
      apb->nbytes > apb->nmaxbytes)
    {
      return -EINVAL;
    }

  bytes = rx ? apb->nmaxbytes : apb->nbytes - apb->curbyte;
  /* The dedicated nxlooper profile uses 4096-byte buffers. Reject partial
   * ring blocks rather than silently pad a successful request with silence.
   */

  /* A zero-length TX FINAL is an ordered queue marker, not DMA data.
   * It is appended normally and retired by the worker only after every
   * earlier request completed. Callbacks remain outside g_lock.
   */

  if ((bytes == 0 && (rx || (apb->flags & AUDIO_APB_FINAL) == 0)) ||
      bytes > 32768 || (bytes % DUP_BLOCK) != 0)
    {
      auderr("Invalid %s buffer: curbyte=%u nbytes=%u max=%u flags=%x\n",
             rx ? "RX" : "TX", apb->curbyte, apb->nbytes,
             apb->nmaxbytes, apb->flags);
      return -EINVAL;
    }

  req = kmm_zalloc(sizeof(*req));
  if (req == NULL)
    {
      return -ENOMEM;
    }

  nxmutex_lock(&g_lock);
  if (ep->pending >= DUP_LIMIT)
    {
      ret = -EAGAIN;
    }
  else if (!ep->active)
    {
      ret = -ESHUTDOWN;
    }
  else
    {
#ifdef CONFIG_ARCH_ADDRENV
      req->addrenv = this_task()->addrenv_curr;
      addrenv_take(req->addrenv);
#endif
      req->apb = apb;
      req->callback = callback;
      req->arg = arg;
      req->bytes = bytes;
      req->queued = clock_systime_ticks();
      for (prior = ep->head; prior != NULL; prior = prior->next)
        {
          ahead += prior->bytes - prior->completed;
        }

      /* Include accepted work ahead of this request, plus one second for
       * clock progress. Eight maximum-size buffers are a legal queue.
       */

      req->queue_timeout = MSEC2TICK(1000 +
                           (ahead * 1000 + byte_rate - 1) / byte_rate);
      req->timeout = timeout != 0 ? timeout :
                     MSEC2TICK(1000 + bytes * 1000 / byte_rate);
      apb_reference(apb);
      if (ep->tail != NULL)
        {
          ep->tail->next = req;
        }
      else
        {
          ep->head = req;
        }

      ep->tail = req;
      ep->pending++;
      nxsem_post(&g_wake);
    }

  nxmutex_unlock(&g_lock);
  if (ret != OK)
    {
      kmm_free(req);
    }

  return ret;
}

