Dr-RegEx/contest2026_497_nitelabu/workspace/openvela-untracked/nuttx/arch/risc-v/src/esp32s31/esp32s31_i2s_duplex.c
static int dup_receive(struct i2s_dev_s *dev, struct ap_buffer_s *apb,
                       i2s_callback_t cb, void *arg, uint32_t timeout)
{
  return dup_enqueue(dev, apb, cb, arg, timeout, true);
}

static int dup_send(struct i2s_dev_s *dev, struct ap_buffer_s *apb,
                    i2s_callback_t cb, void *arg, uint32_t timeout)
{
  return dup_enqueue(dev, apb, cb, arg, timeout, false);
}

static int dup_channels(struct i2s_dev_s *dev, uint8_t channels)
{
#ifdef CONFIG_ESP32S31_I2S_CAPTURE_16K_MONO
  struct dup_endpoint_s *ep = (struct dup_endpoint_s *)dev;
  return channels == (ep->rx ? 1 : 2) ? OK : -EINVAL;
#else
  return channels == 2 ? OK : -EINVAL;
#endif
}

static uint32_t dup_rate(struct i2s_dev_s *dev, uint32_t rate)
{
  return rate == DUP_RATE ? rate : 0;
}

static uint32_t dup_width(struct i2s_dev_s *dev, int bits)
{
  return bits == 16 ? 16 : 0;
}

static uint32_t dup_getmclk(struct i2s_dev_s *dev)
{
  return DUP_MCLK;
}

static uint32_t dup_setmclk(struct i2s_dev_s *dev, uint32_t frequency)
{
  return frequency == DUP_MCLK ? frequency : 0;
}

static int dup_ioctl(struct i2s_dev_s *dev, int cmd, unsigned long arg)
{
  struct dup_endpoint_s *ep = (struct dup_endpoint_s *)dev;
  struct audio_buf_desc_s *desc = (struct audio_buf_desc_s *)arg;
  int ret = OK;

  switch (cmd)
    {
      case AUDIOIOC_START:
        nxmutex_lock(&g_lock);
        if (ep->active || ep->pending != 0)
          {
            ret = -EBUSY;
          }
        else
          {
            ep->active = true;
            if (!g_ep[1].dma_running)
              {
                ret = dup_start_dma(&g_ep[1]);
              }

            if (ret == OK && !ep->rx)
              {
                ret = dup_start_dma(ep);
              }

            if (ret != OK)
              {
                dup_cancel(ep, ret);
              }
          }

        nxmutex_unlock(&g_lock);
        return ret;

      case AUDIOIOC_STOP:
      case AUDIOIOC_SHUTDOWN:
        nxmutex_lock(&g_lock);
        dup_cancel(ep, -ECANCELED);
        nxsem_post(&g_wake);
        nxmutex_unlock(&g_lock);
        return OK;

      case AUDIOIOC_ALLOCBUFFER:
        return desc == NULL ? -EINVAL : apb_alloc(desc);

      case AUDIOIOC_FREEBUFFER:
        if (desc == NULL || desc->u.buffer == NULL)
          {
            return -EINVAL;
          }

        apb_free(desc->u.buffer);
        return sizeof(*desc);

      default:
        return -ENOTTY;
    }
}

static const struct i2s_ops_s g_dup_ops =
{
  .i2s_rxchannels = dup_channels,
  .i2s_rxsamplerate = dup_rate,
  .i2s_rxdatawidth = dup_width,
  .i2s_receive = dup_receive,
  .i2s_txchannels = dup_channels,
  .i2s_txsamplerate = dup_rate,
  .i2s_txdatawidth = dup_width,
  .i2s_send = dup_send,
  .i2s_getmclkfrequency = dup_getmclk,
  .i2s_setmclkfrequency = dup_setmclk,
  .i2s_ioctl = dup_ioctl,
};

struct i2s_dev_s *esp32s31_i2s_duplex_initialize(bool rx)
{
  int cpuint[2];
  int source[2] = {DUP_TX_SOURCE, DUP_RX_SOURCE};
  int direction;
  int ret;
  int pin;
  irqstate_t flags;

  if (g_ready)
    {
      return &g_ep[rx].dev;
    }

  /* DMA descriptors and payload must be in uncached internal SRAM. The S31
   * linker places DRAM_ATTR in this region, outside both flash/PSRAM caches.
   */

  if (!esp_ptr_internal(g_data) || !esp_ptr_dma_capable(g_data) ||
      !esp_ptr_internal(g_desc) || !esp_ptr_dma_capable(g_desc) ||
      esp_cache_msync(g_data, sizeof(g_data),
                      ESP_CACHE_MSYNC_FLAG_DIR_C2M) !=
                      ESP_ERR_NOT_SUPPORTED ||
      esp_cache_msync(g_desc, sizeof(g_desc),
                      ESP_CACHE_MSYNC_FLAG_DIR_C2M) !=
                      ESP_ERR_NOT_SUPPORTED)
    {
      return NULL;
    }

  nxsem_init(&g_wake, 0, 0);
  esp32s31_audio_pa(false);
  for (pin = 52; pin <= 56; pin++)
    {
      if (esp_configgpio(pin, pin == 54 ? INPUT : OUTPUT) < 0)
        {
          goto fail_sem;
        }
    }

  esp_gpio_matrix_in(54, I2S0_I_SD_PAD_IN_IDX, false);
  esp_gpio_matrix_out(56, I2S0_O_SD_PAD_OUT_IDX, false, false);
  flags = enter_critical_section();
  i2s_ll_enable_bus_clock(0, true);
  i2s_ll_reset_register(0);
  i2s_hal_init(&g_hal, 0);
  i2s_ll_enable_core_clock(g_hal.dev, true);
  gdma_ll_enable_bus_clock(0, true);
  ahb_dma_ll_force_enable_reg_clock(DUP_DMA, true);
  ahb_dma_ll_set_default_memory_range(DUP_DMA);
  ahb_dma_ll_rx_connect_to_periph(DUP_DMA, 0, SOC_GDMA_TRIG_PERIPH_I2S0CH0);
  ahb_dma_ll_tx_connect_to_periph(DUP_DMA, 0, SOC_GDMA_TRIG_PERIPH_I2S0CH0);
  ahb_dma_ll_rx_enable_owner_check(DUP_DMA, 0, true);
  ahb_dma_ll_tx_enable_owner_check(DUP_DMA, 0, true);
  ahb_dma_ll_tx_enable_auto_write_back(DUP_DMA, 0, true);
  ahb_dma_ll_tx_set_eof_mode(DUP_DMA, 0, 1);
  for (direction = 0; direction < 2; direction++)
    {
      g_ep[direction].rx = direction != 0;
      g_ep[direction].dev.ops = &g_dup_ops;
      dup_stop_dma(&g_ep[direction]);
    }

  leave_critical_section(flags);
  dup_configure();
  for (direction = 0; direction < 2; direction++)
    {
      cpuint[direction] = esp_setup_irq(source[direction], 1,
                                      ESP_IRQ_TRIGGER_LEVEL);
      if (cpuint[direction] < 0)
        {
          goto fail_irq;
        }

      ret = irq_attach(ESP_SOURCE2IRQ(source[direction]), dup_irq,
                       &g_ep[direction]);
      if (ret < 0)
        {
          esp_teardown_irq(source[direction], cpuint[direction]);
          goto fail_irq;
        }

      up_enable_irq(ESP_SOURCE2IRQ(source[direction]));
    }

  ret = kthread_create("s31_duplex",
                       CONFIG_ESP32S31_I2S_DUPLEX_WORKER_PRIORITY,
                       4096, dup_worker, NULL);
  if (ret < 0)
    {
      goto fail_irq;
    }

  g_ready = true;
#ifdef CONFIG_ESP32S31_FLASH_AUDIO_TRACE
  kthread_create("s31_observe", 254, 4096, dup_trace_observer, NULL);
#endif
  return &g_ep[rx].dev;

fail_irq:
  while (--direction >= 0)
    {
      up_disable_irq(ESP_SOURCE2IRQ(source[direction]));
      irq_detach(ESP_SOURCE2IRQ(source[direction]));
      esp_teardown_irq(source[direction], cpuint[direction]);
    }

fail_sem:
  nxsem_destroy(&g_wake);
  return NULL;
}
